import React from 'react';
import ItemFaIrytailes from './../../components/item-fairytales/'
const testData = {
        "audioUrl": "http://kazku.novi-drova.com/audio/id_0.mp3",
        "createTime": 0,
        "id": 0,
        "imageUrl": "https://docs.google.com/uc?id=0B6q3ecSsA9VxSFRTSjVvbC1GWEk",
        "lullaby": false,
        "name": "Журавель та лисиця",
        "text": "На болоті в очереті на купині жив журавель, там же, трохи поодаль, жила лисиця. Вони щодня зустрічались, їм не раз доводилось вести між собою розмову про своє життя. Разів два ходили в куми до дрохви.\nОдного разу лисиця попрохала журавля до себе в гості: «Приходь, куме, до мене в гості, а то ми з тобою уже давно познайомились, а досі одне в другого не були в домі».\n— «Добре, кумасю, сьогодні зайду».\nЛисиця побігла додому, наварила молочної каші з манної крупи, розмазала її по тарілці і дожидала гостя. Прийшов журавель, лисиця заходилась його пригощати: «Їж, їж, куме, не соромся, будь, як удома». Журавель нахилив голову до тарілки, довбав, довбав носом по тарілці, нічого не зачепив, у рот і одної крихти не попало. А лисиця не дрімала, швиденько язиком лизь-лизь і живо спорожнила тарілку. Потім каже журавлеві: «Не гнівайся, куме, більше потчувать нічим, чим багата, тим і рада».\nЖуравель дуже розгнівався на лисицю за її безсовісну хитрість, та нічого на це не сказав, а тільки подумав: «Погоди, я тебе пригощу іще не так, будеш довго згадувати кума!»\nЖуравель, ідучи од лисиці, в свою чергу попрохав її до себе на обід: «Приходь же й ти, кумасю, до мене завтра, я приготую смачний обід».\n— «Добре, добре, прийду, твоя гостя».\nЖуравель добув кубушку з вузеньким горлом і глечик з широким горлом. В кубушку наклав рисової каші з маслом, а в глечик укинув мишу і стояв, чекав на гостю. Дивиться - мчиться лисиця. Він низько поклонився і каже: «Милості прошу, кумасю, сідай обідати, у мене обід з двох блюд».\nПочали вони обідати. Журавель раз по раз устромляв голову в кубушку і на весь рот ковтав кашу. А лисиця вертілась біля кубушки, хвостом виляла та тільки облизувалась, а каші дістати не могла. То понюхає, то лизьне край горла кубушки, то пильно подивиться всередину, а голову ніяк не можна було просунуть. Лисиця бачить, що журавель уже доїдає кашу, відійшла од кубушки і приступила до глечика. Побачивши в глечику мишу, сказала: «Ти, куме, доїдай кашу, а я приймусь за друге блюдо, аби швидше».\nЛисиця кинулась до глечика і насилу всунула в нього свою голову, саме в горлі дуже туго йшла. Просунувши в горло голову, лисиця почала клацати зубами, ловила мишу. Мотала головою, поки миша попала їй в рот. Вона схрумала мишу і почала вигадувати, як їй звільнити свою голову. Журавель доїв кашу і каже: «Не положи гніву, кумасю, пригощати більше нічим, чим багатий, тим і радий».\nЛисиці стидно стало, що вона через свою жадобу влізла в глечик з головою і ніяк не може висунуть звідти голову, побрела од журавля разом з глечиком. Лисиця заблукала з дороги і поплелася, куди попало. Наткнулась вона на пастухів. Пастухи похватали кийки, оточили лисицю і почали її буздикать кийками. Вона куди не тикнеться - все на кийок наткнеться.\nПастухи добре-таки їй ребра напарили, хотіли до смерті вколотить, та один хлопець нехотя ударив кийком по глечикові і розбив його. Лисиці тоді видно стало, куди тікати, шмигнула од пастухів і помчалась що єсть духу, аж курява вставала.\nЗ того часу дружба між журавлем і лисицею розійшлась. Лисиця утекла в ліс і вже більше з журавлем не зустрічалась.",
        "updateTime": 1512364087434,
        "updated": true
    }

const AudioFairytales = () => {
    return (
        <div>
            <h1>AudioFairytales</h1>
            <ItemFaIrytailes
                name={testData.name}
                text={testData.text}
                audioUrl={testData.audioUrl}
                createTime={testData.createTime}
                id={testData.id}
                imageUrl={testData.imageUrl}
                lullaby={testData.lullaby}
                updateTime={testData.updateTime}
                updated={testData.updated}
                />
        </div>
    )
};

export default AudioFairytales;